In [1]:
import pandas as pd
sr=pd.Series(range(5,51,10))
print(sr)
sr=pd.Series(range(5,51,10), index=['a','b','c','d','e'])
print(sr)

0     5
1    15
2    25
3    35
4    45
dtype: int64
a     5
b    15
c    25
d    35
e    45
dtype: int64

In [2]:
emp={'김철수':5000, '김철호':7000,'한상민':4000,'문대용':4500}
sr=pd.Series(emp)
print(sr)

김철수    5000
김철호    7000
한상민    4000
문대용    4500
dtype: int64

In [4]:
a=pd.DataFrame({
    'name':['김철수','김대희','송영민','이희연','정미숙'],
    'weight':[88.0, 70.4, 65.5, 45.9, 51.2],
    'height':[170, 180, 155, 143, 154],
    'gender':['m', 'm', 'm', 'f', 'f']
})
print('체중')
print(a['weight'])
print("신장과 체중")
print(a[['weight','height']])
print('신장 170 이상')
print(a[a.height>=170])
print('성별 m')
print(a[a.gender=='m'])
print('키 오름차순')
print(a.sort_values(by='height'))
print('체중 내림차순')
print(a.sort_values(by='weight',ascending=False))

체중
0    88.0
1    70.4
2    65.5
3    45.9
4    51.2
Name: weight, dtype: float64
신장과 체중
   weight  height
0    88.0     170
1    70.4     180
2    65.5     155
3    45.9     143
4    51.2     154
신장 170 이상
  name  weight  height gender
0  김철수    88.0     170      m
1  김대희    70.4     180      m
성별 m
  name  weight  height gender
0  김철수    88.0     170      m
1  김대희    70.4     180      m
2  송영민    65.5     155      m
키 오름차순
  name  weight  height gender
3  이희연    45.9     143      f
4  정미숙    51.2     154      f
2  송영민    65.5     155      m
0  김철수    88.0     170      m
1  김대희    70.4     180      m
체중 내림차순
  name  weight  height gender
0  김철수    88.0     170      m
1  김대희    70.4     180      m
2  송영민    65.5     155      m
4  정미숙    51.2     154      f
3  이희연    45.9     143      f

In [5]:
data={"names":["김철수","이철호","김영희","박민수","송철호"],
"year":[2014,2015,2016,2017,2018],
"points":[150,170,360,240,290]}
df=pd.DataFrame(data)
df

  names  year  points
0   김철수  2014     150
1   이철호  2015     170
2   김영희  2016     360
3   박민수  2017     240
4   송철호  2018     290

In [6]:
df.values

array([['김철수', 2014, 150],
       ['이철호', 2015, 170],
       ['김영희', 2016, 360],
       ['박민수', 2017, 240],
       ['송철호', 2018, 290]], dtype=object)

In [7]:
df.columns

Index(['names', 'year', 'points'], dtype='object')

In [8]:
df.describe()

              year      points
count     5.000000    5.000000
mean   2016.000000  242.000000
std       1.581139   86.429162
min    2014.000000  150.000000
25%    2015.000000  170.000000
50%    2016.000000  240.000000
75%    2017.000000  290.000000
max    2018.000000  360.000000